app/controllers/events_controller.rb

  def index
    @number_of_hours = 24
    @number_of_days = 7
    @events = Event.all
---
SELECT "events".* FROM "events"

  def create
    @event = Event.new(event_params)
    @event.user_id = current_user.id
    @event.save
---
INSERT INTO "events" ("name", "date", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Football"], ["date", "2015-01-01 00:00:00.000000"], ["description", "Super cool event"], ["created_at", "2015-02-24 17:01:20.614718"], ["updated_at", "2015-02-24 17:01:20.614718"]]

    def set_event
      @event = Event.find_by_id(params[:id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT 1  [["id", 12]]